---
kind: type
id: T:Autodesk.Revit.DB.Structure.ConnectionInputPoint
source: html/8f40a39a-d5f3-16dc-eada-47f602a780f4.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint

An object that holds information about a connection input point

## Syntax (C#)
```csharp
public class ConnectionInputPoint : IDisposable
```